In [2]:
import pandas as pd

In [54]:
df1 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")
df2 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv")
df3 = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv")

# Lab | Data Structuring and Combining Data

## Challenge 1: Combining & Cleaning Data

In this challenge, we will be working with the customer data from an insurance company, as we did in the two previous labs. The data can be found here:
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

But this time, we got new data, which can be found in the following 2 CSV files located at the links below.

- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file2.csv
- https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file3.csv

Note that you'll need to clean and format the new data.

Observation:
- One option is to first combine the three datasets and then apply the cleaning function to the new combined dataset
- Another option would be to read the clean file you saved in the previous lab, and just clean the two new files and concatenate the three clean datasets

In [56]:
columns = list(df1)

for column in columns:
    print(df1[column].value_counts(),"\n")

Customer
RB50392    1
HJ15383    1
AO74776    1
HQ82233    1
OL72737    1
          ..
RO26085    1
ES57969    1
JK55587    1
RN97635    1
MY31220    1
Name: count, Length: 1071, dtype: int64

ST
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64

GENDER
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64

Education
Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: count, dtype: int64

Customer Lifetime Value
445811.34%     4
251459.20%     4
272535.64%     3
578018.22%     3
684615.03%     3
              ..
245357.08%     1
507566.27%     1
321497.94%     1
1227534.31%    1
899704.02%     1
Name: count, Length: 1027, dtype: int64

Income
0.0        252
43860.0      4
17622.0      4
36650.0      3
14072.0      3
          ...
29486.0      1
58557.0      1
25632.0      1
18768.0      1
54230.0      1
Name: count, Length: 774, dtype: int64

Monthly Premium Auto
65.0     47
63.0     39
71.0     37
67.0     37
73.0     37
         ..
177.0     1
181.0     1
276.0     1
253.0     1
199.0     1
Name: count, Length: 132, dtype: int64

Number of Open Complaints
1/0/00    830
1/1/00    138
1/2/00     50
1/3/00     34
1/4/00     13
1/5/00      6
Name: count, dtype: int64

Policy Type
Personal Auto     780
Corporate Auto    234
Special Auto       57
Name: count, dtype: int64

Vehicle Class
Four-Door Car    576
Two-Door Car     205
SUV              199
Sports Car        57
Luxury SUV        20
Luxury Car        14
Name: count, dtype: int64

Total Claim Amount
321.600000    19
331.200000    15
312.000000    14
350.400000    14
316.800000    12
              ..
421.484456     1
430.505942     1
7.646763       1
55.510526      1
207.320041     1
Name: count, Length: 761, dtype: int64

In [58]:
df1 = df1.rename(columns={"ST":"State", "GENDER":"Gender"})

In [60]:
df1 = df1.dropna(how="all")

In [62]:
columns2 = ["State", "Gender", "Education", "Customer Lifetime Value", "Vehicle Class"]

for column in columns2:
    print(df1[column].value_counts(),"\n")

State
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64

Gender
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64

Education
Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: count, dtype: int64

Customer Lifetime Value
445811.34%     4
251459.20%     4
272535.64%     3
578018.22%     3
684615.03%     3
              ..
245357.08%     1
507566.27%     1
321497.94%     1
1227534.31%    1
899704.02%     1
Name: count, Length: 1027, dtype: int64

Vehicle Class
Four-Door Car    576
Two-Door Car     205
SUV              199
Sports Car        57
Luxury SUV        20
Luxury Car        14
Name: count, dtype: int64

In [64]:
df1.State = df1.State.replace({"Cali":"California", "WA":"Washington", "AZ":"Arizona"})

In [66]:
df1.Gender = df1.Gender.replace({"Male":"M", "female":"F", "Femal":"F"})

In [70]:
df1.Education = df1.Education.replace("Bachelors", "Bachelor")

In [72]:
df1["Vehicle Class"] = df1["Vehicle Class"].replace({"Sports Car":"Luxury", "Luxury SUV":"Luxury", "Luxury Car":"Luxury"})

In [82]:
df1["Customer Lifetime Value"] = df1["Customer Lifetime Value"].str.replace("%","")

In [84]:
columns2 = ["State", "Gender", "Education", "Customer Lifetime Value", "Vehicle Class"]

for column in columns2:
    print(df1[column].value_counts(),"\n")

State
California    331
Oregon        320
Arizona       211
Washington    111
Nevada         98
Name: count, dtype: int64

Gender
F    502
M    452
Name: count, dtype: int64

Education
Bachelor                331
College                 313
High School or Below    296
Master                   94
Doctor                   37
Name: count, dtype: int64

Customer Lifetime Value
445811.34     4
251459.20     4
272535.64     3
578018.22     3
684615.03     3
             ..
245357.08     1
507566.27     1
321497.94     1
1227534.31    1
899704.02     1
Name: count, Length: 1027, dtype: int64

Vehicle Class
Four-Door Car    576
Two-Door Car     205
SUV              199
Luxury            91
Name: count, dtype: int64

In [116]:
df1["Customer Lifetime Value"] = df1["Customer Lifetime Value"].astype(float)
df1["Income"] = df1["Income"].astype(float)
df1["Monthly Premium Auto"] = df1["Monthly Premium Auto"].astype(float)
df1["Total Claim Amount"] = df1["Total Claim Amount"].astype(float)

In [114]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1071 entries, 0 to 1070
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   1071 non-null   object
 1   State                      1071 non-null   object
 2   Gender                     954 non-null    object
 3   Education                  1071 non-null   object
 4   Customer Lifetime Value    1068 non-null   float64
 5   Income                     1071 non-null   float64
 6   Monthly Premium Auto       1071 non-null   float64
 7   Number of Open Complaints  1071 non-null   object
 8   Policy Type                1071 non-null   object
 9   Vehicle Class              1071 non-null   object
 10  Total Claim Amount         1071 non-null   float64
dtypes: float64(4), object(7)
memory usage: 100.4+ KB

In [118]:
df1.isna().sum()

Customer                       0
State                          0
Gender                       117
Education                      0
Customer Lifetime Value        3
Income                         0
Monthly Premium Auto           0
Number of Open Complaints      0
Policy Type                    0
Vehicle Class                  0
Total Claim Amount             0
dtype: int64

In [120]:
df1[df1["Customer Lifetime Value"].isna()]

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
78,SP81997,Washington,F,Master,NaN,41275.0,96.0,1/0/00,Personal Auto,Four-Door Car,41.122303
988,GT62080,Washington,M,High School or Below,NaN,55561.0,63.0,1/0/00,Personal Auto,Four-Door Car,227.872071

In [122]:
df1[(df1["Policy Type"] == "Personal Auto") & (df1["Vehicle Class"] == "Four-Door Car")]["Customer Lifetime Value"].mean()

676736.4223950618

In [126]:
df1["Customer Lifetime Value"] = df1["Customer Lifetime Value"].fillna(df1[(df1["Policy Type"] == "Personal Auto") & (df1["Vehicle Class"] == "Four-Door Car")]["Customer Lifetime Value"].mean())

In [132]:
df1["Gender"] = df1["Gender"].bfill()

In [134]:
df1.isna().sum()

Customer                     0
State                        0
Gender                       0
Education                    0
Customer Lifetime Value      0
Income                       0
Monthly Premium Auto         0
Number of Open Complaints    0
Policy Type                  0
Vehicle Class                0
Total Claim Amount           0
dtype: int64

In [150]:
df1["Number of Open Complaints"] = df1["Number of Open Complaints"].apply(lambda x: x.split("/")[1]).astype(int)

In [168]:
df1["Income"] = df1["Income"].astype(int)
df1["Monthly Premium Auto"] = df1["Monthly Premium Auto"].astype(int)

In [170]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1071 entries, 0 to 1070
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   1071 non-null   object
 1   State                      1071 non-null   object
 2   Gender                     1071 non-null   object
 3   Education                  1071 non-null   object
 4   Customer Lifetime Value    1071 non-null   float64
 5   Income                     1071 non-null   int32
 6   Monthly Premium Auto       1071 non-null   int32
 7   Number of Open Complaints  1071 non-null   int32
 8   Policy Type                1071 non-null   object
 9   Vehicle Class              1071 non-null   object
 10  Total Claim Amount         1071 non-null   float64
dtypes: float64(2), int32(3), object(6)
memory usage: 87.9+ KB

In [166]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 996 entries, 0 to 995
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   996 non-null    object
 1   State                      996 non-null    object
 2   Gender                     991 non-null    object
 3   Education                  996 non-null    object
 4   Customer Lifetime Value    992 non-null    float64
 5   Income                     996 non-null    int64
 6   Monthly Premium Auto       996 non-null    int64
 7   Number of Open Complaints  996 non-null    int32
 8   Total Claim Amount         996 non-null    float64
 9   Policy Type                996 non-null    object
 10  Vehicle Class              996 non-null    object
dtypes: float64(2), int32(1), int64(2), object(6)
memory usage: 81.8+ KB

In [182]:
df2.isna().sum()

Customer                     0
State                        0
Gender                       0
Education                    0
Customer Lifetime Value      0
Income                       0
Monthly Premium Auto         0
Number of Open Complaints    0
Total Claim Amount           0
Policy Type                  0
Vehicle Class                0
dtype: int64

In [142]:
df2columns = list(df2)

for column in df2columns:
    print(df2[column].value_counts(),"\n")

Customer
GS98873    1
MI62456    1
SB50826    1
XX29952    1
AT93647    1
          ..
ZI47663    1
GO14008    1
BC43958    1
AI61368    1
SA91515    1
Name: count, Length: 996, dtype: int64

ST
Oregon        303
California    277
Arizona       142
Nevada        125
Washington    100
AZ             49
Name: count, dtype: int64

GENDER
F         527
M         461
female      2
Male        1
Name: count, dtype: int64

Education
College                 311
High School or Below    290
Bachelor                243
Master                   86
Doctor                   49
Bachelors                17
Name: count, dtype: int64

Customer Lifetime Value
552821.28%     4
600521.48%     3
538949.95%     3
1203662.05%    3
871704.98%     3
              ..
728503.10%     1
1765196.34%    1
1702989.34%    1
403931.50%     1
399258.39%     1
Name: count, Length: 950, dtype: int64

Income
0        221
36088      4
26876      4
83846      3
66429      3
        ...
21514      1
27722      1
21506      1
10312      1
83640      1
Name: count, Length: 733, dtype: int64

Monthly Premium Auto
66     41
71     40
61     35
67     35
72     34
       ..
194     1
287     1
142     1
297     1
143     1
Name: count, Length: 126, dtype: int64

Number of Open Complaints
1/0/00    796
1/1/00    109
1/2/00     43
1/3/00     26
1/4/00     16
1/5/00      6
Name: count, dtype: int64

Total Claim Amount
316.800000    21
345.600000    18
292.800000    16
355.200000    15
340.800000    15
              ..
97.176153      1
151.133360     1
424.330166     1
389.673944     1
700.349052     1
Name: count, Length: 667, dtype: int64

Policy Type
Personal Auto     756
Corporate Auto    196
Special Auto       44
Name: count, dtype: int64

Vehicle Class
Four-Door Car    519
Two-Door Car     211
SUV              174
Sports Car        55
Luxury SUV        21
Luxury Car        16
Name: count, dtype: int64

In [160]:
df2 = df2.rename(columns={"ST":"State", "GENDER":"Gender"})
df2.State = df2.State.replace("AZ", "Arizona")
df2.Gender = df2.Gender.replace({"female":"F", "Male":"M"})
df2.Education = df2.Education.replace("Bachelors", "Bachelor")
df2["Customer Lifetime Value"] = df2["Customer Lifetime Value"].str.replace("%","").astype(float)
df2["Number of Open Complaints"] = df2["Number of Open Complaints"].apply(lambda x: x.split("/")[1]).astype(int)
df2["Vehicle Class"] = df2["Vehicle Class"].replace({"Sports Car":"Luxury", "Luxury SUV":"Luxury", "Luxury Car":"Luxury"})

In [172]:
df2["Gender"] = df2["Gender"].bfill()

In [176]:
df2[df2["Customer Lifetime Value"].isna()]

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Total Claim Amount,Policy Type,Vehicle Class
325,RI52095,Washington,M,High School or Below,NaN,51878,66,1,316.800000,Personal Auto,Four-Door Car
372,HF88410,Washington,F,High School or Below,NaN,36765,66,1,320.849072,Personal Auto,Four-Door Car
580,MW80236,Washington,M,Master,NaN,0,70,0,336.000000,Personal Auto,Four-Door Car
861,TO60700,Washington,F,Bachelor,NaN,25859,74,0,355.200000,Special Auto,Four-Door Car

In [180]:
df2["Customer Lifetime Value"] = df2["Customer Lifetime Value"].fillna(df2[(df2["Policy Type"] == "Personal Auto") & (df2["Vehicle Class"] == "Four-Door Car")]["Customer Lifetime Value"].mean())

In [194]:
df2 = df2.reindex(['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value', 'Income', 'Monthly Premium Auto', 'Number of Open Complaints', 'Policy Type', 'Vehicle Class', 'Total Claim Amount'], axis=1)

In [196]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7070 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   7070 non-null   object
 1   State                      7070 non-null   object
 2   Customer Lifetime Value    7070 non-null   float64
 3   Education                  7070 non-null   object
 4   Gender                     7070 non-null   object
 5   Income                     7070 non-null   int64
 6   Monthly Premium Auto       7070 non-null   int64
 7   Number of Open Complaints  7070 non-null   int64
 8   Policy Type                7070 non-null   object
 9   Total Claim Amount         7070 non-null   float64
 10  Vehicle Class              7070 non-null   object
dtypes: float64(2), int64(3), object(6)
memory usage: 607.7+ KB

In [200]:
df3.isna().sum()

Customer                     0
State                        0
Customer Lifetime Value      0
Education                    0
Gender                       0
Income                       0
Monthly Premium Auto         0
Number of Open Complaints    0
Policy Type                  0
Total Claim Amount           0
Vehicle Class                0
dtype: int64

In [206]:
df3columns = list(df3)

for column in df3columns:
    print(df3[column].value_counts(),"\n")

Customer
SA25987    1
EO99750    1
JM98365    1
QI11566    1
VG43444    1
          ..
TR96772    1
JU64043    1
ZE59592    1
FT74388    1
Y167826    1
Name: count, Length: 7070, dtype: int64

State
California    2544
Oregon        1978
Arizona       1302
Nevada         659
Washington     587
Name: count, dtype: int64

Customer Lifetime Value
2647.519741     6
2659.705650     6
4686.469674     6
4270.034394     6
13727.799720    6
               ..
11281.524510    1
8759.592518     1
4928.001408     1
4896.261605     1
2611.836866     1
Name: count, Length: 6288, dtype: int64

Education
Bachelor                2152
College                 2058
High School or Below    2030
Master                   572
Doctor                   258
Name: count, dtype: int64

Gender
F    3576
M    3494
Name: count, dtype: int64

Income
0        1821
95697       8
74015       6
62873       6
37876       6
         ...
80797       1
89410       1
52728       1
43199       1
21941       1
Name: count, Length: 4463, dtype: int64

Monthly Premium Auto
65     270
66     237
73     233
71     227
63     223
      ...
284      1
231      1
296      1
235      1
142      1
Name: count, Length: 194, dtype: int64

Number of Open Complaints
0    5629
1     765
2     283
3     230
4     119
5      44
Name: count, dtype: int64

Policy Type
Personal Auto     5256
Corporate Auto    1535
Special Auto       279
Name: count, dtype: int64

Total Claim Amount
316.800000    86
312.000000    85
292.800000    84
302.400000    79
350.400000    78
              ..
324.695555     1
696.034509     1
930.594707     1
36.980596      1
790.784983     1
Name: count, Length: 4025, dtype: int64

Vehicle Class
Four-Door Car    3546
Two-Door Car     1480
SUV              1401
Luxury            643
Name: count, dtype: int64

In [204]:
df3["Vehicle Class"] = df3["Vehicle Class"].replace({"Sports Car":"Luxury", "Luxury SUV":"Luxury", "Luxury Car":"Luxury"})

In [208]:
df3 = df3.reindex(['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value', 'Income', 'Monthly Premium Auto', 'Number of Open Complaints', 'Policy Type', 'Vehicle Class', 'Total Claim Amount'], axis=1)

In [210]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1071 entries, 0 to 1070
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   1071 non-null   object
 1   State                      1071 non-null   object
 2   Gender                     1071 non-null   object
 3   Education                  1071 non-null   object
 4   Customer Lifetime Value    1071 non-null   float64
 5   Income                     1071 non-null   int32
 6   Monthly Premium Auto       1071 non-null   int32
 7   Number of Open Complaints  1071 non-null   int32
 8   Policy Type                1071 non-null   object
 9   Vehicle Class              1071 non-null   object
 10  Total Claim Amount         1071 non-null   float64
dtypes: float64(2), int32(3), object(6)
memory usage: 87.9+ KB

In [212]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 996 entries, 0 to 995
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   996 non-null    object
 1   State                      996 non-null    object
 2   Gender                     996 non-null    object
 3   Education                  996 non-null    object
 4   Customer Lifetime Value    996 non-null    float64
 5   Income                     996 non-null    int64
 6   Monthly Premium Auto       996 non-null    int64
 7   Number of Open Complaints  996 non-null    int32
 8   Policy Type                996 non-null    object
 9   Vehicle Class              996 non-null    object
 10  Total Claim Amount         996 non-null    float64
dtypes: float64(2), int32(1), int64(2), object(6)
memory usage: 81.8+ KB

In [214]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7070 entries, 0 to 7069
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   7070 non-null   object
 1   State                      7070 non-null   object
 2   Gender                     7070 non-null   object
 3   Education                  7070 non-null   object
 4   Customer Lifetime Value    7070 non-null   float64
 5   Income                     7070 non-null   int64
 6   Monthly Premium Auto       7070 non-null   int64
 7   Number of Open Complaints  7070 non-null   int64
 8   Policy Type                7070 non-null   object
 9   Vehicle Class              7070 non-null   object
 10  Total Claim Amount         7070 non-null   float64
dtypes: float64(2), int64(3), object(6)
memory usage: 607.7+ KB

In [216]:
df_total = pd.concat([df1, df2, df3], ignore_index=True)

In [218]:
df_total.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9137 entries, 0 to 9136
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   9137 non-null   object
 1   State                      9137 non-null   object
 2   Gender                     9137 non-null   object
 3   Education                  9137 non-null   object
 4   Customer Lifetime Value    9137 non-null   float64
 5   Income                     9137 non-null   int64
 6   Monthly Premium Auto       9137 non-null   int64
 7   Number of Open Complaints  9137 non-null   int64
 8   Policy Type                9137 non-null   object
 9   Vehicle Class              9137 non-null   object
 10  Total Claim Amount         9137 non-null   float64
dtypes: float64(2), int64(3), object(6)
memory usage: 785.3+ KB

In [222]:
df_total.isna().sum()

Customer                     0
State                        0
Gender                       0
Education                    0
Customer Lifetime Value      0
Income                       0
Monthly Premium Auto         0
Number of Open Complaints    0
Policy Type                  0
Vehicle Class                0
Total Claim Amount           0
dtype: int64

In [226]:
df_total.duplicated().sum()

3

In [230]:
df_total = df_total.drop_duplicates()

In [232]:
df_total.duplicated().sum()

0

In [234]:
df_total.head()

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,F,Master,6.767364e+05,0,1000,0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,6.979536e+05,0,94,0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1.288743e+06,48767,108,0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,7.645862e+05,0,106,0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,5.363077e+05,36357,68,0,Personal Auto,Four-Door Car,17.269323

# Challenge 2: Structuring Data

In this challenge, we will continue to work with customer data from an insurance company, but we will use a dataset with more columns, called marketing_customer_analysis.csv, which can be found at the following link:

https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv

This dataset contains information such as customer demographics, policy details, vehicle information, and the customer's response to the last marketing campaign. Our goal is to explore and analyze this data by performing data cleaning, formatting, and structuring.

In [4]:
import pandas as pd
mkt_df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/marketing_customer_analysis_clean.csv")
mkt_df.head()

,unnamed:_0,customer,state,customer_lifetime_value,response,coverage,education,effective_to_date,employmentstatus,gender,...,number_of_policies,policy_type,policy,renew_offer_type,sales_channel,total_claim_amount,vehicle_class,vehicle_size,vehicle_type,month
0,0,DK49336,Arizona,4809.216960,No,Basic,College,2011-02-18,Employed,M,...,9,Corporate Auto,Corporate L3,Offer3,Agent,292.800000,Four-Door Car,Medsize,A,2
1,1,KX64629,California,2228.525238,No,Basic,College,2011-01-18,Unemployed,F,...,1,Personal Auto,Personal L3,Offer4,Call Center,744.924331,Four-Door Car,Medsize,A,1
2,2,LZ68649,Washington,14947.917300,No,Basic,Bachelor,2011-02-10,Employed,M,...,2,Personal Auto,Personal L3,Offer3,Call Center,480.000000,SUV,Medsize,A,2
3,3,XL78013,Oregon,22332.439460,Yes,Extended,College,2011-01-11,Employed,M,...,2,Corporate Auto,Corporate L3,Offer2,Branch,484.013411,Four-Door Car,Medsize,A,1
4,4,QA50777,Oregon,9025.067525,No,Premium,Bachelor,2011-01-17,Medical Leave,F,...,7,Personal Auto,Personal L2,Offer1,Branch,707.925645,Four-Door Car,Medsize,A,1

In [10]:
#mkt_df.isna().sum()

1. You work at the marketing department and you want to know which sales channel brought the most sales in terms of total revenue. Using pivot, create a summary table showing the total revenue for each sales channel (branch, call center, web, and mail).
Round the total revenue to 2 decimal points.  Analyze the resulting table to draw insights.

In [34]:
mkt_pivot_df = round(mkt_df.pivot(columns="sales_channel", values = "customer_lifetime_value"), 2)
mkt_pivot_df.describe().T

,count,mean,std,min,25%,50%,75%,max
sales_channel,,,,,,,,
Agent,4121.0,8021.812099,6687.472497,1898.01,4160.0200,5849.32,9029.9400,67907.27
Branch,3022.0,8060.622528,6972.770059,1918.12,3956.6125,5781.02,9101.5625,74228.52
Call Center,2141.0,8110.363545,7134.944500,1940.98,4045.3400,5729.86,8991.1200,83325.38
Web,1626.0,7809.122411,6881.947179,1994.77,3729.7000,5619.69,8533.8300,60556.19

In [78]:
sales_summary = round(mkt_df.groupby('sales_channel')['customer_lifetime_value'].sum(), 2)
sales_summary

sales_channel
Agent          33057887.85
Branch         24359201.21
Call Center    17364288.37
Web            12697632.90
Name: customer_lifetime_value, dtype: float64

2. Create a pivot table that shows the average customer lifetime value per gender and education level. Analyze the resulting table to draw insights.

In [60]:
mkt_pivot2_df = round(mkt_df.pivot_table(index="gender" ,columns="education", values = "customer_lifetime_value"), 2)
mkt_pivot2_df

education  Bachelor  College   Doctor  High School or Below   Master
gender
F           7874.27  7748.82  7328.51               8675.22  8157.05
M           7703.60  8052.46  7415.33               8149.69  8168.83

## Bonus

You work at the customer service department and you want to know which months had the highest number of complaints by policy type category. Create a summary table showing the number of complaints by policy type and month.
Show it in a long format table.

*In data analysis, a long format table is a way of structuring data in which each observation or measurement is stored in a separate row of the table. The key characteristic of a long format table is that each column represents a single variable, and each row represents a single observation of that variable.*

*More information about long and wide format tables here: https://www.statology.org/long-vs-wide-data/*

In [72]:
#list(mkt_df)

In [74]:
cs_df = round(mkt_df.pivot_table(index="policy_type" ,columns="month", values = "number_of_open_complaints"), 2)
cs_df

month              1     2
policy_type
Corporate Auto  0.35  0.35
Personal Auto   0.40  0.38
Special Auto    0.37  0.47

In [76]:
long_format_complaints = mkt_df.pivot_table(index=["policy_type", "month"], values="number_of_open_complaints", aggfunc="sum").reset_index()
long_format_complaints

      policy_type  month  number_of_open_complaints
0  Corporate Auto      1                 443.434952
1  Corporate Auto      2                 385.208135
2   Personal Auto      1                1727.605722
3   Personal Auto      2                1453.684441
4    Special Auto      1                  87.074049
5    Special Auto      2                  95.226817